run/cyclicBC_debug_case2D_parallel/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-0.1 0 0); // -0.05);

boundaryField
{
    "(right|left)"
    {
        type            cyclic;
    }

    "(top|bottom)"
    { 
        type cyclic;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
