run/cyclicBC_debug_case2D_parallel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./clean

restore0Dir

runApplication blockMesh

runApplication setAlphaField

runApplication decomposePar -cellDist

runParallel interIsoFoam_cyclic_TUD #interIsoFoam_cyclic_TUD  #interFlow #interIsoRhoFoam -tScheme Euler #interFlow

runApplication reconstructPar

foamSequenceVTKFiles -vtp

touch foam.foam

#------------------------------------------------------------------------------
